PLAYER_START_X = 5
PLAYER_START_Y = 4
SPAWN_POINT = { "x1": PLAYER_START_X - 4, 
                "x2": PLAYER_START_X + 4,
                "y1": PLAYER_START_Y - 4,
                "y2": PLAYER_START_Y + 4
              }

BOARD_WIDTH = 100
BOARD_HEIGHT = 35

KEY_BINDINGS = set()
KEY_BINDINGS_MOVE = {"left": ["a", "4"],
                "right": ["d", "6"],
                "up": ["w", "8"],
                "down": ["s", "2"],
                "leftUP": ["q", "7"],
                "leftDOWN": ["z", "1"],
                "rightUP": ["e", "9"],
                "rightDOWN": ["c", "3"]
                }
KEY_BINDINGS = {"inventory": ("i"),
                "customize": ("k"),
                "stats" : ("b"),
                "exit": ("`"),
                "overlay": ("o"),
                "logo": ("l"),
                "story": ("p"),
                "verbal_attack": ("v"),
                "generator": ("g"),
                "clear": ("x")
                }
KEY_BINDINGS_FIGHT = {
                "Fight": ("1"),
                "Use inventory": ("2"),
                "Try to escape": ("3"),
                }
PLAYER_ICON = { "head":  "👨",
                "body": "👕",
                "legs":  "👖",
                "rightHand": "🔪",
                "leftHand": "🗡"
                }
BODY_PARTS = {  "heads" : ["👨","👶","👧","🧒","👦","👩","🧑","👨","👵","🧓","👴"],
                "bodies" : ["👕","🧥","👚","👗","👙"],
                "legs" : ["👖","👠","👡","👢","👞","👟"]}

# TE EMOJI ZAJMUJA TYLKO 1 MIEJSCE!
# "🥾","🥿","🥼"

ENEMIES = { "icons": ("ᴥ","Ӝ", "ȣ"),
            "small": {"icon": "ᴥ",
                    "HP": 10,
                    "DMG": 1,
                    "speed": 1
                    },
            "big": {"icon": "Ӝ",
                    "HP": 20,
                    "DMG": 3,
                    "speed": 1
                    },
            "boss": {"icon": "ȣ",
                     "HP": 50,
                     "DMG": 5,
                     "speed": 1
                    }
        }

PICKUPS = {'▀','▄','●'}

WALL = "█"
BACKGROUND = " " #⬛️"
GRASS = "ˇ"
BUSH = "Ψ"
PASSABLE = set()
PASSABLE = {GRASS, BUSH, BACKGROUND, "†","۩", ENEMIES["small"]["icon"], ENEMIES["big"]["icon"], "●", "▄", "▀", "▌", "▐"}

word_used = -1

TREE = ["""
    ˯
   /║\\
  //║\\\\
  //║\\\\
 ///║\\\\\\
 ///║\\\\\\
////║\\\\\\\\
^^^^║^^^^"""]

TREE2 = ["""
    ˯
   /˷\\
  /˷˷ˆ\\
  /ˆ˷ˆ\\
 /˷ˆˆ˷ˆ\\
 /˷ˆ˷ˆ˷\\
/ˆ˷ˆˆ˷ˆ˷\\
^^^[_]^^^"""]

BUSHES = ["""
 ΨΨ Ψ ΨΨ
   ΨΨ ΨΨΨΨ Ψ   Ψ
Ψ    ΨΨΨΨ Ψ ΨΨ
ΨΨΨΨ Ψ ΨΨ Ψ    Ψ
    Ψ   Ψ     Ψ
Ψ
""","""
Ψ
    Ψ   Ψ     Ψ
ΨΨΨΨ Ψ ΨΨ Ψ    Ψ
ΨΨ ΨΨ Ψ Ψ   Ψ
    Ψ
""","""
    Ψ       Ψ
        ΨΨ    Ψ
     Ψ  Ψ
Ψ
"""]

TREES = ["""
  ▒▓▓▓▓▒
 ▒▓▓▓▓▓▓▒
▒▓▒▓▒▓▓▓▓▒
▒▒▓▓▓▓▒▓▓▓▒
▓▓▓▒░▓▒▒▓▓▒
 ▒▒▓▓▓▒▒▒▒
 ▀  ░░
    ░░
    ░░
  ░░░▒▒▒""",
"""
   ▓▓▒▒▒▒▓▓
▓▓▒▒▓▒▓▒░▓▒▒
▓▒▒░▓▓▒▒▓▓▒▒▓
▒▓▓▒▒▒▓▓▒▒▒▒▒▒
▓▓▒▒▒▓░▒▒▒▒▓▓▓
 ▓▓▓▒▒░▒▒▒▒▓▓
     ░░  ▀
     ░░
    ▄░░▒
   ▒░░░░▒░░""",
"""
    ▓▓
   ▓▓▓▒
  ▓▓▓▒▒▒
  ▓▓▓▒▒▒
  ▓▓▓▓▒▒▒
 ▒▓▓▓▓▓▒▒
▒▓▓▓▓▓▓▓▒▒
▓▓▓▓▓▓▓▓▓▒
    ░
   ▄░"""]

BUSH2 = [
"""    ˬ
   \|/
  \\\\|//
 \\\\\\Y///
 \\\\\\|///
\\\\\\\\Y////
\\\\\\\\|////
 `\\\\Y//
   `║"""]

CEMENTERY = """
‡‡‡‡‡‡‡‡‡‡‡‡‡‡‡
║ ˇˇˇ   ˇˇ   ˇ║
║ˇ  † ˇ  †    
║             
║ ˇˇ† ˇˇ †   ˇ║
║ˇ           ˇ‡‡‡‡‡‡‡‡‡‡‡‡‡‡‡‡‡‡‡‡
║  ˇ۩    †    ●ˇ  ˇ †   ۩  ˇˇˇˇˇ║
║ˇˇ  ˇ      ˇ     ˇ       ˇ ˇˇ  ║
║   ۩    ۩ˇ   ●   ˇˇ†   †   ˇˇ  ║
║ˇ    ˇ          ˇ ˇ     ˇ      ║
║ ˇ ۩    ۩ˇ   ●     †   ۩ ˇ     ║
║ ˇ ˇˇ      ˇ         ˇ ˇ ˇ  ˇˇ ║
‡‡‡‡‡‡‡‡‡‡‡‡  Ӝ  ˇ‡‡‡‡‡‡‡‡‡‡‡‡‡‡‡
"""

LAKE = """
              ░▌▐░ ████
        ██████░▌▐░██████████
      ████████░▌▐░█████████████
     █████████░▌▐░██████████████
  ████████████░▌▐░█████████████
 █████████████░▌▐░███████████
██████████████░▌▐░████
  ██████████ˇ ░▌▐░
"""
