MAPS = \
["""████████████████████████████████████████████████████████████████████████████████████████████████████
█ˇ   ˇˇ     ˇ     ΨΨˇ                              ‡         ΨΨΨ       ˇ۩   †     ˇ  ˇ †   ۩ ΨΨΨ   █
█      ˇ    ˇ ˇ   ˇ Ψ      ˇˇˇ ˇˇ  ˇ   ˇˇ    ˇ Ψ ▒▓▓▓▓▒‡‡‡‡‡‡‡‡‡‡‡‡‡ˇˇ  ˇ        ●   ˇ       ˇ    Ψ█
█   ˇ  Ψ         ˇ ˇ      ˇ     Ψ ˇ  ˇ   ˇ     ▓▓▓▓▓▓▓▓▒Ψ ˇ       ˇ║    ۩   ۩ˇ   ●   ˇˇ†   †   ˇˇ ˇ█
█ˇ ˇ ˇ               ˇ  ˇ         ˇ      ˇˇ   ▓▓▓▒▓▒▓▓▓▓▒  ˇ       ║     ˇ       ●  ˇ ˇ     ˇ      █
█                  ˇ           ˇ  ˇ      ˇ   ▓▓▓▒▒▒▓▓▒▓▓▓▒ΨΨˇˇ ˇ   ║    ۩   ۩ˇ         †   ۩ ˇ    ˇ█
█ˇ       ˇ ˇ     ˇ   ˇ ˇ               ˇˇ ˇ  ▓▓▓▒▒▒░▓▒▒▓▓▒ ΨΨΨ     ║    ˇ      ˇ         ˇ ˇ ˇ  ˇΨΨ█
█       Ψ  ˇˇˇ   ˇ           ˇ▓▓ ˇ     ˇ ˇ  ˇ▓▓▓▓▒▒▒▓▒▒▒▒█████ΨΨΨΨˇ‡‡‡‡‡‡‡‡‡‡‡‡  Ӝ  ˇ‡‡‡‡‡‡‡‡‡‡‡‡‡‡█
█ ˇ    ˇˇ                    ▓▓▓▒ ˇ   ˇ ˇ   ▒▓▓▓▓▓▒▒░ ██████████ΨΨΨ  ˇ       ˇˇ       ˇ  ˇ ˇ Ψ  ˇ  █
█ ˇ    ˇˇ    ˇˇ  ˇ          ▓▓▓▒▒▒        ˇ▒▓▓▓▓▓▓▓▒▒██▒▓▓▓▓▒██████ΨΨ   ˇ    ˇˇ        ˇ    ˇ      █
█       ˇ  ˇ    ˇ ˇˇ   ˇ    ▓▓▓▒▒▒    ᴥˇ   ▓▓▓▓▓▓▓▓▓▒ ▒▓▓▓▓▓▓▒██ΨΨΨΨ ˇ   ˇ    ˇ    ˇ  ˇ       ˇ   ˇ█
█   ˇ  ˇ   ˇ ˇ  ˇˇ     ˇˇ ▓▓▓▓░▓▒▒▒     ˇˇ     ░ ░░░▒▒▓▒▓▒▓▓▓▓▒██ΨΨ    ˇ            ˇ      ˇ     ˇ █
█   ˇ ˇˇ ▓▓▒▒▒▒▓▓ˇˇ    ▓▓▒▒▒▓▓░▓▓▒▒            ░ ΨΨ▒▓▓▓▓▒▓▓▒▓▓▓▒█ ˇ    ˇ     ˇ    ˇ  ˇ ˇ    ˇˇ     █
█ Ψ ˇ ▓▓▒▒▓▒▓▒░▓▒▒  ˇΨ ▓▒▒▒▓▓▓▓▓▓▓▒▒    ˇˇ       Ψ▒▓▓▓▓▓▓▒▓▒▒▓▓▒█   Ψ ˇ    ˇˇˇ       ˇ       ˇ Ψ  ˇ█
█  ˇ ˇ▓▒▒░▓▓▒▒▓▓▒▒  ˇ  ▒▓▓▓▓▓▓▓▓▓▓▓▒          ˇΨΨ▒▓▒▓▒▓▓▓▓▒▒▒▒▒███Ψ ˇ                ˇ ˇ       ˇ   █
█     ▒▓▓▒▒▒▓▓▒▒▒▒     ▓▓▒▒▒▓▒▒▒▒▒▓ˇ       ˇ   Ψ ▒▒▓▓▓▓▒▓▓▓▒█████████ˇΨ  ˇˇ ˇ      ˇˇˇ ˇ ˇ  ˇ      █
█     ▓▓▒▒▒▓░▒▒▒▒▓ ˇ  ▓▓▓▓▓▒▒▓▒▒▒▒▓     ˇˇ    ΨΨΨ▓▓▓▒░▓▒▒▓▓▒██████████████ΨΨΨ    ˇ         ˇ       █
█  ˇ ˇ ▓▓▓▒▒░▒▒▒▒▓   ▓▓▓▒ˇ ˇ░░       ˇˇ ˇˇ    ˇΨΨ ▒▒▓▓▓▒▒▒▒█████████████████ΨΨ ˇ       ˇ  Ψ  ˇ  ˇ  █
█ˇ       ▀ ░░ˇ  ˇˇ  ▓▓▓▒▒▒  ░░     ˇ  ˇ        ˇ ΨΨΨ ░░░░░▒▒▒██████████████████ΨΨ ˇ     ˇ    ˇˇ    █
█  ˇ       ░░   ˇˇ  ▓▓▓▒▒▒  ░░▒▄   ˇ         ˇ    ˇΨΨ░░ ████████████████████████Ψ            ˇ ˇ ˇˇ█
█     ˇ    ░░▒   ˇˇ ▓▓▓▓▒▒▒░░░░▒░░      ˇ   ˇˇˇˇ   ˇ▓▓▒▒▒▒▓▓████████████████████Ψˇ  ˇ  ˇ ˇ         █
█     ˇ ˇ▒░░░░▒░░  ▒▓▓▓▓▓▒▒  ΨˇΨ Ψ    ˇ    ˇ   ˇ ▓▓▒▒▓▒▓▒░▓▒▒████████████████████ˇ ˇ     ˇ        ˇ█
█ˇ                ▒▓▓▓▓▓▓▓▒▒ ΨΨ  ˇˇˇ    ˇˇ       ▓▒▒░▓▓▒▒▓▓▒▒████████████████  ˇˇ  ˇ     ˇ     ˇ   █
█   ˇˇˇ  ˇ  ▒▓▓▓▓▒▓▓▓▓▓▓▓▓▓▒Ψ ˇˇ       ˇ     Ψ   ▒▓▓▒▒▒▓▓▒▒▒▒████████████ Ψ ˇΨ      ˇˇ   ˇ  ˇ   ˇ  █
█  Ψ   ▓▓▄ˇ▒▓▓▓▓▓▓▒   ░ˇ    ˇ ˇˇˇ   ˇˇ ˇ ˇˇ      ▓▓▒▒▒▓░▒▒▒▒▓ΨΨ██████Ψ  Ψ      ˇ        ˇ  ˇ    ˇ ˇ█
█     ▓▓▓▒▒▓▒▓▒▓▓▓▓▒  ░             ˇ ˇ    ˇ      ▓▓▓▒▒░▒▒▒▒▓  ΨΨΨΨΨΨˇ    ˇ  ˇ     ˇˇˇ    ˇˇ   ˇ  Ψ█
█ ˇ  ▓▓▓▒▒▒▒▓▓▓▓▒▓▓▓▒ˇ ˇ       ˇˇ          ˇ    ˇ     ░░ ▀    ˇ  ΨΨ ˇˇ        ˇˇ ˇ          ˇˇ░▌▐░ █
█    ▓▓▓▒▒▒▓▓▒░▓▒▒▓▓▒       ˇ  ˇ     ˇ   Ψ       ˇ    ░░ˇ  ˇ        ˇ     ˇ ˇ   ˇ   ˇ     Ψ ˇ█░▌▐░██
█ ˇ  ▓▓▓▓▒▒▒▒▓▓▓▒▒▒▒ ˇ    ˇ     ˇ     ˇ ˇ  ˇ      ˇ ˇˇ░░▒  ˇ    ˇ    ˇ        ˇ ˇ     Ψˇ Ψ████░▌▐░██
█  ˇ▒▓▓▓▓▓▒▒  ░░    ˇ   ˇ     ΨΨ    ˇ ˇ             ▒░░░░▒░░ˇ  ˇ               ˇˇΨˇΨΨ█████████░▌▐░ █
█  ▒▓▓▓▓▓▓▓▒▒ ░░  ˇˇ    ˇ  ˇ   ˇ       ˇ   ˇ ˇˇ ˇ  ˇ       ˇ         ˇ  ˇ   ΨˇΨΨˇˇΨ█████████  ● ●  █
█ˇ ▓▓▓▓▓▓▓▓▓▒ ░░ ▄  ˇ         ˇ ˇ ˇ   ˇ    ˇˇ   ˇ   ˇ ˇ  ˇ            ˇ ΨΨ Ψ███████████████  ● ● ●ˇ█
█      ░    ░░░▒▒▒   ● ● ˇˇ      ˇ          Ψ    ˇ       ˇˇ ˇ    ˇ     Ψ Ψ█████████████████Ψ  ● ●  █
█ΨΨ ˇ  ░ ΨΨΨΨ ˇ  Ψ        ˇ  ˇˇ ˇ             ˇ    ˇˇ ˇ  ˇ  ˇ     ˇ ΨΨΨΨΨ████████████████████ ΨΨΨ ██
████████████████████████████████████████████████████████████████████████████████████████████████████""",

"""████████████████████████████████████████████████████████████████████████████████████████████████████
█       ˇ  ˇ   ˇΨΨˇ    ˇ ˇ       Ψ ▒▓▓▓▓▓▓▒   ˇ   ˇ   ˇ   Ψˇ      ˇˇ  ˇ   ˇˇ         ˇ     ˇ ˇΨˇ   █
█ Ψˇ      ˇˇˇ   Ψ Ψˇˇ   ˇ ˇ      ˇ▒▓▒▓▒▓▓▓▓▒ˇ      ˇ▓▓     ˇ  ˇ●  ●  ●  ●  ●  ●  ●  ●ˇ   ˇˇ        █
█Ψ  ˇˇ ˇ       ˇ         ˇˇ  ˇ    ▒▒▓▓▓▓▒▓▓▓▒   ˇ  ▓▓▓▒   ˇ        ˇ  ˇ      ˇˇ          ˇ    ˇ    █
█     ˇˇ    ˇ         ˇ        ˇ  ▓▓▓▒░▓▒▒▓▓▒ ˇ   ▓▓▓▒▒▒      ˇ ˇ  ˇ      ˇ   ˇ  ˇ              ˇ  █
█     ˇˇ ˇ                 ˇ ˇ   Ψˇ▒▒▓▓▓▒▒▒▒ ˇ    ▓▓▓▒▒▒      ˇ   ˇ ˇ   ˇ ˇ      ˇ     Ψ   ˇˇˇ  ˇ  █
█ˇ     ˇˇ ▒▓▓▓▓▓        ˇ  ˇ     ˇ    ░░         ˇ▓▓▓▓▒▒▒         Ψ ˇ    ˇ   ˇˇΨ ░▌▐░ ████ ΨΨ Ψ    █
█ˇˇ    ˇ ▒▓▓▓▓▓▓▒   ˇ   ˇ    ▒▓▓▓▓▒  ˇ░░    ˇˇˇ  ▒▓▓▓▓▓▒▒ˇ       ˇ  Ψ Ψ ΨΨΨ██████░▌▐░██████████Ψ   █
█ˇ ˇ   ˇ▒▓▒▓▓▓▓▒▒▒ˇ   ˇ   ˇ ▒▓▓▓▓▓▓▒ˇ ░░ˇΨ      ▒▓▓▓▓▓▓▓▒▒▒▓▓ ˇ   ˇ   ΨΨ█████████░▌▐░█████████████Ψ█
█   ˇ   ▒▒▓▓▓▓▓▒▒▒▒ ˇ     ˇ▒▓▒▓▒▓▓▓▓▒░░░▒▒  ▒▓▓▓▓▓▓▓▓▓▓▓▓▒░▓▒▒   ˇΨΨΨΨΨΨ█████████░▌▐░███████████████
█  ˇ  ˇ ▓▓▓▒▓▓▓▓▒▒▒    ˇˇˇ ▒▒▓▓▓▓▒▓▓▓▒     ▒▓▓▓▓▓▓▓▒░░▓▓▒▒▓▓▒▓▓ ˇ ΨΨΨ████████████░▌▐░█████████████ˇ█
█ Ψ      ▒▒▒▓▓▓▓▓▒▒     ˇ  ▓▓▓▒░▓▒▒▓▓▒    ▒▓▒▓▒▓▓▓▒▓░▒▒▒▓▓▒▒▓▓▓▒   Ψ█████████████░▌▐░███████████ ΨΨ█
█  ˇ ˇ    ▒▓▓▓▓▓▓▓▒▒ˇ   ˇ ˇ ▒▒▓▓▓▒▒▒▒ˇ  ˇ ▒▒▓▓▓▓▒▓▓▓▒▒▒▓░▒▒▓▓▓▒▒▒ Ψ██████████████░▌▐░████Ψ ΨΨΨΨ Ψ ˇ█
█    ˇˇ   ▓▓▓▓▓▓▓▓▓▒     ˇ  ˇΨ ░░ ˇˇˇ     ▓▓▓▒░▓▒▒▓▓▓▓▒▒░▒▒▓▓▓▒▒▒  ˇΨ██████████ˇ ░▌▐░ ΨΨΨ ΨΨ Ψ Ψ   █
█       ˇ  ˇ░░░      ˇ  ˇ    ˇ ░░   ˇ  ˇ   ▒▒▓▓▓▒▒▒▒░  ░░ˇ ▓▓▓▓▒▒▒  ˇΨ ˇΨΨΨˇ Ψ ˇΨ       Ψ          █
█ ˇ ˇ  ˇ ˇ░░░▒░▒ Ψ    ˇ      ▄ˇ░░      ˇ   Ψ ˇ░░ ˇ▀ˇ ˇ ░░ ▒▓▓▓▓▓▒▒      ΨΨ  ˇ    ˇ           ˇ   ˇ █
█  ˇ ˇ           ˇˇ  ˇ    ˇ  ░░░▒▒   ˇ ˇ ˇ    ░░   ˇ   ░░▒▓▓▓▓▓▓▓▒▒ˇˇ       ˇ         ˇ ˇ  ˇ  ˇ    █
█  ˇ    ˇ ˇˇ     ˇ      ˇ  ˇ ˇˇ      ˇ        ░░ ▄   ▒░░░▓▓▓▓▓▓▓▓▓▒▒▒▒▒▓▓    ˇ  ˇˇ  ˇ             ˇ█
█ ˇ Ψ      ˇ  ˇ ˇˇ      ˇ  ˇ           ˇ     ░░░░▒   ˇˇ     ˇ░▓▓▒▒▓▒▓▒░▓▒▒   ˇ   ˇ       ˇ   ˇˇ    █
█   ▓▓▒▒▒▒▓▓  ˇˇ  Ψ  ˇ            ˇ  ˇ ˇ ˇˇ ˇ      ˇ        ˇ░▓▒▒░▓▓▒▒▓▓▒▒    ˇ ˇ    ˇ    ˇ       ˇ█
█▓▓▒▒▓▒▓▒░▓▒▒       ▓▓    ˇ     ˇˇ         ˇ  ˇ          ˇˇ   ▒▓▓▒▒▒▓▓▒▒▒▒  ˇˇ    ˇ        ˇ    ˇ ˇ█
█▓▒▒░▓▓▒▒▓▓▒▒      ▓▓▓▒ˇ        ˇ ˇ         Ψ ˇ  ˇ  ˇˇ   ˇ  ˇˇ▓▓▒▒▒▓░▒▒▒▒▓ ˇ    ˇ     ●ˇˇ  ˇˇ    Ψ █
█▒▓▓▒▒▒▓▓▒▒▒▒     ▓▓▓▒▒▒ˇ    ˇ ˇ ˇ      ˇˇ      ˇ     ˇ  ˇ ˇ   ▓▓▓▒▒░▒▒▒▒▓ˇ ˇ     ˇ    ˇ         ˇ █
█▓▓▒▒▒▓░▒▒▒▒▓    ˇ▓▓▓▒▒▒ˇ        ˇΨ   ˇ        ˇ ˇ     ˇ  ˇ     ˇ  ░░ ˇ ˇˇˇ     ˇˇ    ●        ˇ   █
█ ▓▓▓▒▒░▒▒▒▒▓ˇ ˇˇ ▓▓▓▓▒▒▒ ˇˇ     Ψˇ  ᴥ     ˇˇ                     ˇ░░  ˇ      ˇˇˇˇ   ˇ     ˇ       █
█ ▀ˇ  ░░        ˇ▒▓▓▓▓▓▒▒ˇ  ‡‡‡‡‡‡‡ˇˇ  ˇˇ‡‡‡‡‡‡‡‡‡‡‡‡‡‡‡‡‡‡‡‡‡‡‡‡‡‡░░▒‡‡‡‡‡‡‡     ˇ   ●   ˇ        █
█  ˇ ˇ░░ˇ  ˇ    ▒▓▓▓▓▓▓▓▒▒ ˇ║ΨΨ  ˇ         ˇ          ˇ      Ψˇ  ▒░░░░▒░░  Ψ║     ˇ   ˇ   ˇ ˇ   Ψ  █
█  ˇ ˇ░░▒▄ˇ    ˇ▓▓▓▓▓▓▓▓▓▒  ║ ۩ ˇ ۩        ۩   †   †   ۩   †   †ˇ  ۩ˇ ˇ۩ ˇ  ║         ●  ˇ ˇ  Ψ   ˇ█
█ˇ ˇ▒░░░░▒░░ˇ   ˇ   ░ˇ   ˇˇ ║Ψ     ˇ              ˇ  ˇˇ ˇ          ˇ        ║ˇ  ˇ     ˇ      ˇ     █
█ ΨˇΨ  ˇ    ˇ       ░      ˇ║ ۩  ˇ۩   ˇ ˇˇ ۩   † ˇˇ†   † ˇ †   † ˇ †   †  ˇˇ║        ˇ●         ˇˇ █
█  Ψ ˇ ˇ ˇ ˇ ˇ   ˇ ˇ ˇ ˇ        ˇ   ˇ    ˇ    ˇ           ˇ   ˇ ˇ            ˇ Ӝ               ˇΨˇ █
█ ΨΨ   Ψ ˇ    ˇ●ˇ ●  ● ˇ         ˇ                       ˇ               ˇ          ˇ  ˇ ˇ ΨΨˇΨ  ˇ █
█ Ψ  ˇΨˇ ˇ ˇ ˇ   ˇ ˇ ˇ ˇ      ΨΨ Ψ Ψ     ˇ †   †   †   †ˇ  †   †   ۩   †     ˇ   ˇ ˇ       Ψ Ψ ˇˇΨ █
█ΨΨΨ ˇ  Ψ   Ψ  ˇ ˇ        ˇ ║ΨΨ Ψ  Ψ  Ψ  ˇˇ   ˇ   ˇˇ  Ψ ˇ ˇ  ˇ ˇ   ˇ ˇ ˇ  ˇ ║     Ψˇ    ΨΨ  Ψ  ΨΨΨ █
████████████████████████████████████████████████████████████████████████████████████████████████████"""
]