MAPS = \
["""████████████████████████████████████████████████████████████████████████████████████████████████████
█ˇ   ˇˇ     ˇ       ˇ                              ‡                   ˇ۩   †     ˇ  ˇ †   ۩       █
█      ˇ    ˇ ˇ   ˇ        ˇˇˇ ˇˇ  ˇ   ˇˇ    ˇ   ▒▓▓▓▓▒‡‡‡‡‡‡‡‡‡‡‡‡‡ˇˇ  ˇ            ˇ       ˇ     █
█   ˇ            ˇ ˇ      ˇ       ˇ  ˇ   ˇ     ▓▓▓▓▓▓▓▓▒  ˇ       ˇ║    ۩   ۩ˇ       ˇˇ†   †   ˇˇ ˇ█
█ˇ ˇ ˇ               ˇ  ˇ         ˇ      ˇˇ   ▓▓▓▒▓▒▓▓▓▓▒  ˇ       ║     ˇ          ˇ ˇ     ˇ      █
█                  ˇ           ˇ  ˇ      ˇ   ▓▓▓▒▒▒▓▓▒▓▓▓▒  ˇˇ ˇ   ║    ۩   ۩ˇ         †   ۩ ˇ    ˇ█
█ˇ       ˇ ˇ     ˇ   ˇ ˇ               ˇˇ ˇ  ▓▓▓▒▒▒░▓▒▒▓▓▒   ˇ     ║    ˇ      ˇ         ˇ ˇ ˇ  ˇˇ █
█          ˇˇˇ   ˇ           ˇ▓▓ ˇ     ˇ ˇ  ˇ▓▓▓▓▒▒▒▓▒▒▒▒    ˇ    ˇ‡‡‡‡‡‡‡‡‡‡‡‡  Ӝ  ˇ‡‡‡‡‡‡‡‡‡‡‡‡‡‡█
█ ˇ    ˇˇ                    ▓▓▓▒ ˇ   ˇ ˇ   ▒▓▓▓▓▓▒▒░        ˇ   ˇ   ˇ       ˇˇ       ˇ  ˇ ˇ    ˇ  █
█ ˇ    ˇˇ    ˇˇ  ˇ          ▓▓▓▒▒▒        ˇ▒▓▓▓▓▓▓▓▒▒  ▒▓▓▓▓▒     ˇ     ˇ    ˇˇ        ˇ    ˇ      █
█       ˇ  ˇ    ˇ ˇˇ   ˇ    ▓▓▓▒▒▒    ᴥˇ   ▓▓▓▓▓▓▓▓▓▒ ▒▓▓▓▓▓▓▒     ˇ ˇ   ˇ    ˇ    ˇ  ˇ       ˇ   ˇ█
█   ˇ  ˇ   ˇ ˇ  ˇˇ     ˇˇ ▓▓▓▓▓▓▒▒▒     ˇˇ     ░ ░░░▒▒▓▒▓▒▓▓▓▓▒  ˇˇ    ˇ            ˇ      ˇ     ˇ █
█   ˇ ˇˇ ▓▓▒▒▒▒▓▓ˇˇ    ▓▓▒▒▒▓▓▓▓▓▒▒            ░   ▒▓▓▓▓▒▓▓▒▓▓▓▒  ˇ    ˇ     ˇ    ˇ  ˇ ˇ    ˇˇ     █
█   ˇ ▓▓▒▒▓▒▓▒░▓▒▒  ˇ  ▓▒▒▒▓▓▓▓▓▓▓▒▒    ˇˇ        ▒▓▓▓▓▓▓▒▓▒▒▓▓▒ˇ     ˇ    ˇˇˇ       ˇ       ˇ    ˇ█
█  ˇ ˇ▓▒▒░▓▓▒▒▓▓▒▒  ˇ  ▒▓▓▓▓▓▓▓▓▓▓▓▒          ˇ  ▒▓▒▓▒▓▓▓▓▒▒▒▒▒   ˇ ˇ                ˇ ˇ       ˇ   █
█     ▒▓▓▒▒▒▓▓▒▒▒▒     ▓▓▒▒▒▓░░▒▒▒▓ˇ       ˇ     ▒▒▓▓▓▓▒▓▓▓▒ ˇ        ˇ ˇˇ ˇ      ˇˇˇ ˇ ˇ  ˇ       █
█     ▓▓▒▒▒▓░▒▒▒▒▓ ˇ  ▓▓▓▓▓▒▒░░▒▒▒▓     ˇˇ       ▓▓▓▒░▓▒▒▓▓▒  ˇ ˇ   ˇ     ˇ         ˇ ˇ      ˇ     █
█  ˇ ˇ ▓▓▓▒▒░▒▒▒▒▓   ▓▓▓▒ˇ ˇ░░       ˇˇ ˇˇ    ˇ   ▒▒▓▓▓▒▒▒▒ ˇ    ˇ        ˇ             ˇ    ˇ  ˇ  █
█ˇ         ░░ˇ  ˇˇ  ▓▓▓▒▒▒  ░░     ˇ  ˇ        ˇ  ˇˇ ░░░░░▒▒▒     ˇ  ˇ  ˇ    ˇ  ˇ ˇ     ˇ    ˇˇ    █
█  ˇ       ░░   ˇˇ  ▓▓▓▒▒▒  ░░▒    ˇ         ˇ    ˇ  ░░ ˇ        ˇˇ    ˇ     ˇ               ˇ ˇ ˇˇ█
█     ˇ    ░░▒   ˇˇ ▓▓▓▓▒▒▒░░░░▒░░      ˇ   ˇˇˇˇ   ˇ▓▓▒▒▒▒▓▓   ˇˇ          ˇˇ ˇ ˇ  ˇ  ˇ ˇ          █
█     ˇ ˇ▒░░░░▒░░  ▒▓▓▓▓▓▒▒   ˇ       ˇ    ˇ   ˇ ▓▓▒▒▓▒▓▒░▓▒▒   ˇ ˇ      ˇ  ˇˇ ˇ     ˇ         ˇ  ˇ█
█ˇ                ▒▓▓▓▓▓▓▓▒▒     ˇˇˇ    ˇˇ       ▓▒▒░▓▓▒▒▓▓▒▒  ˇ ˇˇ         ˇˇ  ˇ     ˇ     ˇ      █
█   ˇˇˇ  ˇ  ▒▓▓▓▓▒▓▓▓▓▓▓▓▓▓▒  ˇˇ       ˇ         ▒▓▓▒▒▒▓▓▒▒▒▒             ˇ       ˇˇ   ˇ  ˇ   ˇ    █
█  ˇ   ▓▓ ˇ▒▓▓▓▓▓▓▒   ░ˇ    ˇ ˇˇˇ   ˇˇ ˇ ˇˇ      ▓▓▒▒▒▓░▒▒▒▒▓ˇˇ               ˇ        ˇ  ˇ    ˇ  ˇ█
█     ▓▓▓▒▒▓▒▓▒▓▓▓▓▒  ░             ˇ ˇ    ˇ      ▓▓▓▒▒░▒▒▒▒▓  ˇ   ˇ ˇ    ˇ  ˇ     ˇˇˇ    ˇˇ   ˇ  ˇ█
█ ˇ  ▓▓▓▒▒▒▒▓▓▓▓▒▓▓▓▒ˇ ˇ       ˇˇ          ˇ    ˇ     ░░      ˇ  ˇ  ˇˇ        ˇˇ ˇ          ˇˇ   ˇ █
█    ▓▓▓▒▒▒▓▓▒░▓▒▒▓▓▒       ˇ  ˇ     ˇ           ˇ    ░░ˇ  ˇ        ˇ     ˇ ˇ   ˇ   ˇ     ˇ ˇ  ˇ  ˇ█
█ ˇ  ▓▓▓▓▒▒▒▒▓▓▓▒▒▒▒ ˇ    ˇ     ˇ     ˇ ˇ  ˇ      ˇ ˇˇ░░▒  ˇ    ˇ    ˇ        ˇ ˇ      ˇ      ˇ   ˇ█
█  ˇ▒▓▓▓▓▓▒▒  ░░    ˇ   ˇ     ˇ     ˇ ˇ             ▒░░░░▒░░ˇ  ˇ               ˇˇˇˇ ˇ ˇˇ  ˇˇˇ      █
█  ▒▓▓▓▓▓▓▓▒▒ ░░  ˇˇ    ˇ  ˇ   ˇ       ˇ   ˇ ˇˇ ˇ  ˇ       ˇ         ˇ  ˇ    ˇ  ˇˇ           ˇ     █
█ˇ ▓▓▓▓▓▓▓▓▓▒ ░░ ˇ  ˇ         ˇ ˇ ˇ   ˇ    ˇˇ   ˇ   ˇ ˇ  ˇ            ˇ  ˇ         ˇˇ              █
█      ░    ░░░▒▒▒   ˇ   ˇˇ      ˇ          ˇ    ˇ       ˇˇ ˇ    ˇ        ˇˇ ˇ   ˇ  ˇ      ˇˇˇ  ˇ  █
█ˇ  ˇ  ░    ˇ ˇ           ˇ  ˇˇ ˇ             ˇ    ˇˇ ˇ  ˇ  ˇ      ˇ ˇ   ˇ     ˇ     ˇˇ            █
████████████████████████████████████████████████████████████████████████████████████████████████████""",

"""████████████████████████████████████████████████████████████████████████████████████████████████████
█       ˇ  ˇ   ˇ  ˇ    ˇ ˇ         ▒▓▓▓▓▓▓▒   ˇ   ˇ   ˇ    ˇ      ˇˇ  ˇ   ˇˇ         ˇ     ˇ ˇ ˇ   █
█  ˇ      ˇˇˇ      ˇˇ   ˇ ˇ      ˇ▒▓▒▓▒▓▓▓▓▒ˇ      ˇ▓▓     ˇ  ˇ      ˇ              ˇˇ   ˇˇ        █
█ˇ  ˇˇ ˇ       ˇ         ˇˇ  ˇ    ▒▒▓▓▓▓▒▓▓▓▒   ˇ  ▓▓▓▒   ˇ        ˇ  ˇ      ˇˇ          ˇ    ˇ    █
█     ˇˇ    ˇ         ˇ        ˇ  ▓▓▓▒░▓▒▒▓▓▒ ˇ   ▓▓▓▒▒▒      ˇ ˇ  ˇ      ˇ   ˇ  ˇ              ˇ  █
█     ˇˇ ˇ                 ˇ ˇ    ˇ▒▒▓▓▓▒▒▒▒ ˇ    ▓▓▓▒▒▒      ˇ   ˇ ˇ   ˇ ˇ      ˇ         ˇˇˇ  ˇ  █
█ˇ     ˇˇ ▒▓▓▓▓▓        ˇ  ˇ     ˇ    ░░         ˇ▓▓▓▓▒▒▒           ˇ              ˇ   ˇˇˇ  ˇˇ   ˇˇ█
█ˇˇ    ˇ ▒▓▓▓▓▓▓▒   ˇ   ˇ    ▒▓▓▓▓▒  ˇ░░    ˇˇˇ  ▒▓▓▓▓▓▒▒ˇ       ˇ                ˇ     ˇ          █
█ˇ ˇ   ˇ▒▓▒▓▓▓▓▒▒▒ˇ   ˇ   ˇ ▒▓▓▓▓▓▓▒ˇ ░░ˇˇ      ▒▓▓▓▓▓▓▓▒▒▒▓▓ ˇ   ˇ        ˇ                       █
█   ˇ   ▒▒▓▓▓▓▓▒▒▒▒ ˇ     ˇ▒▓▒▓▒▓▓▓▓▒░░░▒▒  ▒▓▓▓▓▓▓▓▓▓▓▓▓▒░▓▒▒   ˇ    ˇ        ˇˇˇ ˇ      ˇ  ˇ     █
█  ˇ  ˇ ▓▓▓▒▓▓▓▓▒▒▒    ˇˇˇ ▒▒▓▓▓▓▒▓▓▓▒     ▒▓▓▓▓▓▓▓▒░░▓▓▒▒▓▓▒▓▓ ˇ ˇˇ   ˇˇ             ˇ ˇ  ˇ   ˇ  ˇ█
█ ˇ      ▒▒▒▓▓▓▓▓▒▒     ˇ  ▓▓▓▒░▓▒▒▓▓▒    ▒▓▒▓▒▓▓▓▒▓░▒▒▒▓▓▒▒▓▓▓▒       ˇ    ˇ  ˇ  ˇˇˇ      ˇ    ˇ  █
█  ˇ ˇ    ▒▓▓▓▓▓▓▓▒▒ˇ   ˇ ˇ ▒▒▓▓▓▒▒▒▒ˇ  ˇ ▒▒▓▓▓▓▒▓▓▓▒▒▒▓░▒▒▓▓▓▒▒▒      ˇ   ˇ     ˇ   ˇ            ˇ█
█    ˇˇ   ▓▓▓▓▓▓▓▓▓▒     ˇ  ˇ  ░░ ˇˇˇ     ▓▓▓▒░▓▒▒▓▓▓▓▒▒░▒▒▓▓▓▒▒▒  ˇ  ˇ   ˇˇ   ˇ   ˇ  ˇ    ˇ       █
█       ˇ  ˇ░░░      ˇ  ˇ    ˇ ░░   ˇ  ˇ   ▒▒▓▓▓▒▒▒▒░  ░░ˇ ▓▓▓▓▒▒▒  ˇ  ˇˇˇˇ ˇ ˇ                    █
█ ˇ ˇ  ˇ ˇ░░░▒░▒      ˇ       ˇ░░      ˇ     ˇ░░ ˇ ˇ ˇ ░░ ▒▓▓▓▓▓▒▒      ˇ   ˇ    ˇ           ˇ   ˇ █
█  ˇ ˇ           ˇˇ  ˇ    ˇ  ░░░▒▒   ˇ ˇ ˇ    ░░   ˇ   ░░▒▓▓▓▓▓▓▓▒▒ˇˇ       ˇ         ˇ ˇ  ˇ  ˇ    █
█  ˇ    ˇ ˇˇ     ˇ      ˇ  ˇ ˇˇ      ˇ        ░░     ▒░░░▓▓▓▓▓▓▓▓▓▒▒▒▒▒▓▓    ˇ  ˇˇ  ˇ             ˇ█
█ ˇ        ˇ  ˇ ˇˇ      ˇ  ˇ           ˇ     ░░░░▒   ˇˇ     ˇ░▓▓▒▒▓▒▓▒░▓▒▒   ˇ   ˇ       ˇ   ˇˇ    █
█   ▓▓▒▒▒▒▓▓  ˇˇ  ˇ  ˇ            ˇ  ˇ ˇ ˇˇ ˇ      ˇ        ˇ░▓▒▒░▓▓▒▒▓▓▒▒    ˇ ˇ    ˇ    ˇ       ˇ█
█▓▓▒▒▓▒▓▒░▓▒▒       ▓▓    ˇ     ˇˇ         ˇ  ˇ          ˇˇ   ▒▓▓▒▒▒▓▓▒▒▒▒  ˇˇ    ˇ        ˇ    ˇ ˇ█
█▓▒▒░▓▓▒▒▓▓▒▒      ▓▓▓▒ˇ        ˇ ˇ         ˇ ˇ  ˇ  ˇˇ   ˇ  ˇˇ▓▓▒▒▒▓░▒▒▒▒▓ ˇ    ˇ      ˇˇ  ˇˇ      █
█▒▓▓▒▒▒▓▓▒▒▒▒     ▓▓▓▒▒▒ˇ    ˇ ˇ ˇ      ˇˇ      ˇ     ˇ  ˇ ˇ   ▓▓▓▒▒░▒▒▒▒▓ˇ ˇ     ˇ    ˇ         ˇ █
█▓▓▒▒▒▓░▒▒▒▒▓    ˇ▓▓▓▒▒▒ˇ        ˇ    ˇ        ˇ ˇ     ˇ  ˇ     ˇ  ░░ ˇ ˇˇˇ     ˇˇ    ˇ        ˇ   █
█ ▓▓▓▒▒░▒▒▒▒▓ˇ ˇˇ ▓▓▓▓▒▒▒ ˇˇ      ˇ  ᴥ     ˇˇ                     ˇ░░  ˇ      ˇˇˇˇ   ˇ     ˇ       █
█  ˇ  ░░        ˇ▒▓▓▓▓▓▒▒ˇ  ‡‡‡‡‡‡‡ˇˇ  ˇˇ‡‡‡‡‡‡‡‡‡‡‡‡‡‡‡‡‡‡‡‡‡‡‡‡‡‡░░▒‡‡‡‡‡‡‡     ˇ       ˇ        █
█  ˇ ˇ░░ˇ  ˇ    ▒▓▓▓▓▓▓▓▒▒ ˇ║ ˇ  ˇ         ˇ          ˇ       ˇ  ▒░░░░▒░░   ║     ˇ   ˇ   ˇ ˇ      █
█  ˇ ˇ░░▒ ˇ    ˇ▓▓▓▓▓▓▓▓▓▒  ║ ۩ ˇ ۩        ۩   †   †   ۩   †   †ˇ  ۩ˇ ˇ۩ ˇ  ║            ˇ ˇ      ˇ█
█ˇ ˇ▒░░░░▒░░ˇ   ˇ   ░ˇ   ˇˇ ║      ˇ              ˇ  ˇˇ ˇ          ˇ        ║ˇ  ˇ     ˇ      ˇ     █
█  ˇ   ˇ    ˇ       ░      ˇ║ ۩  ˇ۩   ˇ ˇˇ ۩   † ˇˇ†   † ˇ †   † ˇ †   †  ˇˇ║        ˇ          ˇˇ █
█    ˇ ˇ ˇ ˇ ˇ   ˇ ˇ ˇ ˇ        ˇ   ˇ    ˇ    ˇ           ˇ   ˇ ˇ            ˇ Ӝ               ˇˇˇ █
█  ˇ     ˇ    ˇˇˇ      ˇ         ˇ                       ˇ               ˇ          ˇ  ˇ ˇ ˇ ˇ   ˇ █
█    ˇ ˇ ˇ ˇ ˇ   ˇ ˇ ˇ ˇ        ˇ   ˇ    ˇ †   †   †   †ˇ  †   †   ۩   †     ˇ   ˇ ˇ           ˇˇˇ █
█    ˇ  ˇ      ˇ ˇ        ˇ ║          ˇ ˇˇ   ˇ   ˇˇ    ˇ ˇ  ˇ ˇ   ˇ ˇ ˇ  ˇ ║      ˇ               █
████████████████████████████████████████████████████████████████████████████████████████████████████"""
]